app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "Computer Science"], ["room_number", 5]]
---
  def create
    # binding.pry
    # binding.pry

    @school_class = SchoolClass.new

    @school_class[:title] = params[:school_class][:title]
    @school_class[:room_number] = params[:school_class][:room_number]
    @school_class.save